================================================================================
Numbers
================================================================================

SELECT 1, 1.2, -5, -1.3, 1E-37, 1E+37;

--------------------------------------------------------------------------------

(source_file
  (select_statement
    (select_clause
      (select_clause_body
        (number)
        (number)
        (unary_expression
          (number))
        (unary_expression
          (number))
        (number)
        (number)))))

================================================================================
SELECT statement
================================================================================

SELECT;
SELECT interval '1 minute';

--------------------------------------------------------------------------------

(source_file
  (select_statement
    (select_clause))
  (select_statement
    (select_clause
      (select_clause_body
        (interval_expression
          (string
            (content)))))))

================================================================================
SELECT statement with distinct expression
================================================================================

SELECT 1 IS DISTINCT FROM NULL;

--------------------------------------------------------------------------------

(source_file
  (select_statement
    (select_clause
      (select_clause_body
        (is_expression
          (number)
          (distinct_from
            (NULL)))))))

================================================================================
SELECT statement FROM clause
================================================================================

SELECT a, b FROM table1;

--------------------------------------------------------------------------------

(source_file
  (select_statement
    (select_clause
      (select_clause_body
        (identifier)
        (identifier)))
    (from_clause
      (identifier))))

================================================================================
SELECT statement with SELECT subexpression
================================================================================

SELECT (SELECT 1) AS a

--------------------------------------------------------------------------------

(source_file
  (select_statement
    (select_clause
      (select_clause_body
        (select_subexpression
          (select_statement
            (select_clause
              (select_clause_body
                (number)))))
        (alias
          (identifier))))))

================================================================================
SELECT statement with aliases
================================================================================

SELECT a, b AS c FROM table1 AS t;

--------------------------------------------------------------------------------

(source_file
  (select_statement
    (select_clause
      (select_clause_body
        (identifier)
        (identifier)
        (alias
          (identifier))))
    (from_clause
      (identifier)
      (alias
        (identifier)))))

================================================================================
SELECT statement with group by
================================================================================

SELECT a, b
FROM table1
GROUP BY lower(a), b;

--------------------------------------------------------------------------------

(source_file
  (select_statement
    (select_clause
      (select_clause_body
        (identifier)
        (identifier)))
    (from_clause
      (identifier))
    (group_by_clause
      (grouping_expression
        (function_call
          (identifier)
          (identifier)))
      (grouping_expression
        (identifier)))))

================================================================================
SELECT statement with order by
================================================================================

SELECT a, b FROM table1 ORDER BY lower(a), b;
SELECT a, b FROM table1 ORDER BY lower(a), b ASC;
SELECT a, b FROM table1 ORDER BY lower(a), b DESC;
SELECT a, b FROM table1 ORDER BY a ASC, b DESC;
SELECT a, b FROM table1 ORDER BY a ASC NULLS FIRST, b DESC NULLS LAST;

--------------------------------------------------------------------------------

(source_file
  (select_statement
    (select_clause
      (select_clause_body
        (identifier)
        (identifier)))
    (from_clause
      (identifier))
    (order_by_clause
      (order_expression
        (function_call
          (identifier)
          (identifier)))
      (order_expression
        (identifier))))
  (select_statement
    (select_clause
      (select_clause_body
        (identifier)
        (identifier)))
    (from_clause
      (identifier))
    (order_by_clause
      (order_expression
        (function_call
          (identifier)
          (identifier)))
      (order_expression
        (identifier)
        (order))))
  (select_statement
    (select_clause
      (select_clause_body
        (identifier)
        (identifier)))
    (from_clause
      (identifier))
    (order_by_clause
      (order_expression
        (function_call
          (identifier)
          (identifier)))
      (order_expression
        (identifier)
        (order))))
  (select_statement
    (select_clause
      (select_clause_body
        (identifier)
        (identifier)))
    (from_clause
      (identifier))
    (order_by_clause
      (order_expression
        (identifier)
        (order))
      (order_expression
        (identifier)
        (order))))
  (select_statement
    (select_clause
      (select_clause_body
        (identifier)
        (identifier)))
    (from_clause
      (identifier))
    (order_by_clause
      (order_expression
        (identifier)
        (order)
        (nulls_order))
      (order_expression
        (identifier)
        (order)
        (nulls_order)))))

================================================================================
SELECT statement FROM multiple tables
================================================================================

SELECT a, b FROM table1, table2;

--------------------------------------------------------------------------------

(source_file
  (select_statement
    (select_clause
      (select_clause_body
        (identifier)
        (identifier)))
    (from_clause
      (identifier)
      (identifier))))

================================================================================
SELECT statement with numbers
================================================================================

SELECT 1, 2;

--------------------------------------------------------------------------------

(source_file
  (select_statement
    (select_clause
      (select_clause_body
        (number)
        (number)))))

================================================================================
SELECT statement with expression
================================================================================

SELECT 1 + 2;

--------------------------------------------------------------------------------

(source_file
  (select_statement
    (select_clause
      (select_clause_body
        (binary_expression
          (number)
          (number))))))

================================================================================
SELECT statement with empty string
================================================================================

SELECT '';

--------------------------------------------------------------------------------

(source_file
  (select_statement
    (select_clause
      (select_clause_body
        (string
          (content))))))

================================================================================
SELECT statement with dollar quoted string
================================================================================

SELECT $$hey$$;

--------------------------------------------------------------------------------

(source_file
  (select_statement
    (select_clause
      (select_clause_body
        (string
          (content))))))

================================================================================
SELECT statement with dollar quoted brackets inside
================================================================================

SELECT $$(a + b)$$;

--------------------------------------------------------------------------------

(source_file
  (select_statement
    (select_clause
      (select_clause_body
        (string
          (content))))))

================================================================================
SELECT statement with type cast
================================================================================

SELECT ''::JSONB;

--------------------------------------------------------------------------------

(source_file
  (select_statement
    (select_clause
      (select_clause_body
        (type_cast
          (string
            (content))
          (type
            (identifier)))))))

================================================================================
SELECT statement with columns
================================================================================

SELECT a, b;

--------------------------------------------------------------------------------

(source_file
  (select_statement
    (select_clause
      (select_clause_body
        (identifier)
        (identifier)))))

================================================================================
SELECT statement with comparison expression
================================================================================

SELECT 1 < 2;

--------------------------------------------------------------------------------

(source_file
  (select_statement
    (select_clause
      (select_clause_body
        (binary_expression
          (number)
          (number))))))

================================================================================
SELECT statement with is expression
================================================================================

SELECT a IS TRUE, b IS NOT NULL, c IS FALSE;

--------------------------------------------------------------------------------

(source_file
  (select_statement
    (select_clause
      (select_clause_body
        (is_expression
          (identifier)
          (TRUE))
        (is_expression
          (identifier)
          (NULL))
        (is_expression
          (identifier)
          (FALSE))))))

================================================================================
SELECT field
================================================================================

SELECT foo.bar FROM a;

--------------------------------------------------------------------------------

(source_file
  (select_statement
    (select_clause
      (select_clause_body
        (dotted_name
          (identifier)
          (identifier))))
    (from_clause
      (identifier))))

================================================================================
Operator precedence
================================================================================

SELECT 1 + -1, 1 <= 1;
SELECT 1 * 2 + 3, 3 + 1 * 2, (3 + 1) * 2;
SELECT 1 / 2 + 3, 3 + 1 / 2, (3 + 1) / 2;
SELECT @1, !!2, |/3, ||/4, ~5, -6, +7;
SELECT @ - 2;

--------------------------------------------------------------------------------

(source_file
  (select_statement
    (select_clause
      (select_clause_body
        (binary_expression
          (number)
          (unary_expression
            (number)))
        (binary_expression
          (number)
          (number)))))
  (select_statement
    (select_clause
      (select_clause_body
        (binary_expression
          (binary_expression
            (number)
            (number))
          (number))
        (binary_expression
          (number)
          (binary_expression
            (number)
            (number)))
        (binary_expression
          (binary_expression
            (number)
            (number))
          (number)))))
  (select_statement
    (select_clause
      (select_clause_body
        (binary_expression
          (binary_expression
            (number)
            (number))
          (number))
        (binary_expression
          (number)
          (binary_expression
            (number)
            (number)))
        (binary_expression
          (binary_expression
            (number)
            (number))
          (number)))))
  (select_statement
    (select_clause
      (select_clause_body
        (unary_expression
          (number))
        (unary_expression
          (number))
        (unary_expression
          (number))
        (unary_expression
          (number))
        (unary_expression
          (number))
        (unary_expression
          (number))
        (unary_expression
          (number)))))
  (select_statement
    (select_clause
      (select_clause_body
        (unary_expression
          (unary_expression
            (number)))))))

================================================================================
SELECT statement with comparison expression and is expression
================================================================================

SELECT 1 < 2 IS TRUE;

--------------------------------------------------------------------------------

(source_file
  (select_statement
    (select_clause
      (select_clause_body
        (is_expression
          (binary_expression
            (number)
            (number))
          (TRUE))))))

================================================================================
SELECT expression with function
================================================================================

SELECT foo(bar, baz) < 10;

--------------------------------------------------------------------------------

(source_file
  (select_statement
    (select_clause
      (select_clause_body
        (binary_expression
          (function_call
            (identifier)
            (identifier)
            (identifier))
          (number))))))

================================================================================
SELECT expression with function without args
================================================================================

SELECT foo(), test.bar(1, 2, 3);

--------------------------------------------------------------------------------

(source_file
  (select_statement
    (select_clause
      (select_clause_body
        (function_call
          (identifier))
        (function_call
          (dotted_name
            (identifier)
            (identifier))
          (number)
          (number)
          (number))))))

================================================================================
SELECT comparison expression boolean
================================================================================

SELECT TRUE AND foo(1) OR FALSE AND NOT a = b.c;

--------------------------------------------------------------------------------

(source_file
  (select_statement
    (select_clause
      (select_clause_body
        (boolean_expression
          (boolean_expression
            (TRUE)
            (function_call
              (identifier)
              (number)))
          (boolean_expression
            (FALSE)
            (binary_expression
              (boolean_expression
                (identifier))
              (dotted_name
                (identifier)
                (identifier)))))))))

================================================================================
SELECT parenthesized expression
================================================================================

SELECT (TRUE);

--------------------------------------------------------------------------------

(source_file
  (select_statement
    (select_clause
      (select_clause_body
        (TRUE)))))

================================================================================
SELECT parenthesized expression 2
================================================================================

SELECT TRUE AND (foo(1) OR FALSE);

--------------------------------------------------------------------------------

(source_file
  (select_statement
    (select_clause
      (select_clause_body
        (boolean_expression
          (TRUE)
          (boolean_expression
            (function_call
              (identifier)
              (number))
            (FALSE)))))))

================================================================================
SELECT string
================================================================================

SELECT 'aaaa'

--------------------------------------------------------------------------------

(source_file
  (select_statement
    (select_clause
      (select_clause_body
        (string
          (content))))))

================================================================================
SELECT weird_string
================================================================================

SELECT '%{a.b}'

--------------------------------------------------------------------------------

(source_file
  (select_statement
    (select_clause
      (select_clause_body
        (string
          (content))))))

================================================================================
SELECT field_access
================================================================================

SELECT foo->>'bar'

--------------------------------------------------------------------------------

(source_file
  (select_statement
    (select_clause
      (select_clause_body
        (json_access
          (identifier)
          (string
            (content)))))))

================================================================================
SELECT in clause
================================================================================

SELECT 1 IN (1, 2);

--------------------------------------------------------------------------------

(source_file
  (select_statement
    (select_clause
      (select_clause_body
        (in_expression
          (number)
          (tuple
            (number)
            (number)))))))

================================================================================
CREATE TYPE statement
================================================================================

CREATE TYPE typename;
CREATE TYPE xest AS (data TEXT, val INT NOT NULL);

--------------------------------------------------------------------------------

(source_file
  (create_type_statement
    (identifier))
  (create_type_statement
    (identifier)
    (type_spec_composite
      (identifier)
      (type
        (identifier))
      (identifier)
      (constrained_type
        (type
          (identifier))
        (null_constraint
          (NULL))))))

================================================================================
CREATE TYPE enum
================================================================================

CREATE TYPE colors AS ENUM ('red', 'green', 'blue');

--------------------------------------------------------------------------------

(source_file
  (create_type_statement
    (identifier)
    (type_spec_enum
      (string
        (content))
      (string
        (content))
      (string
        (content)))))

================================================================================
CREATE TYPE range
================================================================================

CREATE TYPE type_name AS RANGE (
  SUBTYPE = date,
  SUBTYPE_DIFF = diff_func,
  CANONICAL = canonical_func
);

--------------------------------------------------------------------------------

(source_file
  (create_type_statement
    (identifier)
    (type_spec_range
      (identifier)
      (identifier)
      (identifier))))

================================================================================
CREATE TYPE base
================================================================================

CREATE TYPE type_name (
  internallength = 16, 
  input = in_func,
  output = out_func
);

--------------------------------------------------------------------------------

(source_file
  (create_type_statement
    (identifier)
    (type_spec_base
      (identifier)
      (identifier))))

================================================================================
CREATE DOMAIN
================================================================================

CREATE DOMAIN test;

--------------------------------------------------------------------------------

(source_file
  (create_domain_statement
    (identifier)))

================================================================================
CREATE DOMAIN with type
================================================================================

CREATE DOMAIN test AS text;

--------------------------------------------------------------------------------

(source_file
  (create_domain_statement
    (identifier)
    (type
      (identifier))))

================================================================================
CREATE DOMAIN with array type
================================================================================

CREATE DOMAIN test_arr AS text[];

--------------------------------------------------------------------------------

(source_file
  (create_domain_statement
    (identifier)
    (array_type
      (type
        (identifier)))))

================================================================================
CREATE DOMAIN type with constraint
================================================================================

CREATE DOMAIN test AS text NOT NULL;

--------------------------------------------------------------------------------

(source_file
  (create_domain_statement
    (identifier)
    (type
      (identifier))
    (null_constraint
      (NULL))))

================================================================================
CREATE DOMAIN array type with constraint
================================================================================

CREATE DOMAIN test AS text[] NOT NULL;

--------------------------------------------------------------------------------

(source_file
  (create_domain_statement
    (identifier)
    (array_type
      (type
        (identifier)))
    (null_constraint
      (NULL))))

================================================================================
CREATE INDEX
================================================================================

CREATE INDEX test_idx ON table(col1, col2);

--------------------------------------------------------------------------------

(source_file
  (create_index_statement
    (identifier)
    (identifier)
    (index_item
      (identifier))
    (index_item
      (identifier))))

================================================================================
CREATE UNIQUE INDEX
================================================================================

CREATE UNIQUE INDEX test_idx ON table(col1, col2);
CREATE UNIQUE INDEX CONCURRENTLY IF NOT EXISTS name ON ONLY table_name USING method (col1, col2);

--------------------------------------------------------------------------------

(source_file
  (create_index_statement
    (unique_constraint)
    (identifier)
    (identifier)
    (index_item
      (identifier))
    (index_item
      (identifier)))
  (create_index_statement
    (unique_constraint)
    (concurrently)
    (if_not_exists)
    (identifier)
    (identifier)
    (using_clause
      (identifier))
    (index_item
      (identifier))
    (index_item
      (identifier))))

================================================================================
CREATE INDEX with function
================================================================================

CREATE INDEX test_idx ON table(lower(col1), col2);
CREATE INDEX text_idx2 ON table(col2 text_pattern_ops);

--------------------------------------------------------------------------------

(source_file
  (create_index_statement
    (identifier)
    (identifier)
    (index_item
      (function_call
        (identifier)
        (identifier)))
    (index_item
      (identifier)))
  (create_index_statement
    (identifier)
    (identifier)
    (index_item
      (identifier)
      (op_class
        (identifier)))))

================================================================================
CREATE INDEX where clause
================================================================================

CREATE INDEX test_idx ON table(col1) WHERE col1 IS NOT NULL;

--------------------------------------------------------------------------------

(source_file
  (create_index_statement
    (identifier)
    (identifier)
    (index_item
      (identifier))
    (where_clause
      (is_expression
        (identifier)
        (NULL)))))

================================================================================
CREATE INDEX where clause not equal
================================================================================

CREATE INDEX test_idx ON table(col1) WHERE col1 <> 1

--------------------------------------------------------------------------------

(source_file
  (create_index_statement
    (identifier)
    (identifier)
    (index_item
      (identifier))
    (where_clause
      (binary_expression
        (identifier)
        (number)))))

================================================================================
CREATE INDEX by expressions
================================================================================

CREATE INDEX test_idx ON table((a + b), div(c, 2));
CREATE INDEX test_idx ON table((a + b) COLLATE collation, div(c, 2));

--------------------------------------------------------------------------------

(source_file
  (create_index_statement
    (identifier)
    (identifier)
    (index_item
      (binary_expression
        (identifier)
        (identifier)))
    (index_item
      (function_call
        (identifier)
        (identifier)
        (number))))
  (create_index_statement
    (identifier)
    (identifier)
    (index_item
      (binary_expression
        (identifier)
        (identifier))
      (collate
        (identifier)))
    (index_item
      (function_call
        (identifier)
        (identifier)
        (number)))))

================================================================================
CREATE INDEX with opclass
================================================================================

CREATE INDEX test_idx ON table(a opclass(param1=1, param2=2), div(c, 2));

--------------------------------------------------------------------------------

(source_file
  (create_index_statement
    (identifier)
    (identifier)
    (index_item
      (identifier)
      (op_class
        (identifier)
        (assignment_expression_list
          (assignment_expression
            (identifier)
            (number))
          (assignment_expression
            (identifier)
            (number)))))
    (index_item
      (function_call
        (identifier)
        (identifier)
        (number)))))

================================================================================
CREATE INDEX with tablespace
================================================================================

CREATE INDEX foo_idx ON table1 (col2 DESC) TABLESPACE tbsp;

--------------------------------------------------------------------------------

(source_file
  (create_index_statement
    (identifier)
    (identifier)
    (index_item
      (identifier)
      (order))
    (tablespace_hint
      (identifier))))

================================================================================
CREATE INDEX complex
================================================================================

CREATE INDEX foo_idx ON table1 (col2, (lower(col1->>'attr')));

--------------------------------------------------------------------------------

(source_file
  (create_index_statement
    (identifier)
    (identifier)
    (index_item
      (identifier))
    (index_item
      (function_call
        (identifier)
        (json_access
          (identifier)
          (string
            (content)))))))

================================================================================
CREATE INDEX using
================================================================================

CREATE INDEX foo_idx ON table1 USING gist (col2);
CREATE INDEX bttest_a_idx ON bttest_a USING btree (id) WITH (deduplicate_items = off);
CREATE UNIQUE INDEX bttest_multi_idx ON bttest_multi USING btree (id) INCLUDE (data);

--------------------------------------------------------------------------------

(source_file
  (create_index_statement
    (identifier)
    (identifier)
    (using_clause
      (identifier))
    (index_item
      (identifier)))
  (create_index_statement
    (identifier)
    (identifier)
    (using_clause
      (identifier))
    (index_item
      (identifier))
    (index_with_clause
      (storage_parameters
        (assignment_expression
          (identifier)
          (identifier)))))
  (create_index_statement
    (unique_constraint)
    (identifier)
    (identifier)
    (using_clause
      (identifier))
    (index_item
      (identifier))
    (index_include_clause
      (identifier_list
        (identifier)))))

================================================================================
CREATE INDEX with order
================================================================================

CREATE INDEX foo_idx ON table1 (col2 DESC);
CREATE INDEX test_idx ON table(a ASC, b DESC NULLS FIRST);

--------------------------------------------------------------------------------

(source_file
  (create_index_statement
    (identifier)
    (identifier)
    (index_item
      (identifier)
      (order)))
  (create_index_statement
    (identifier)
    (identifier)
    (index_item
      (identifier)
      (order))
    (index_item
      (identifier)
      (order)
      (nulls_order))))

================================================================================
CREATE TABLE
================================================================================

CREATE TABLE my_table (col1 INT, col2 INT);
CREATE TABLE my_table () WITHOUT OIDS;
CREATE TEMPORARY TABLE my_table2 (col1 INT, col2 INT);

--------------------------------------------------------------------------------

(source_file
  (create_table_statement
    (identifier)
    (table_parameters
      (table_column
        (identifier)
        (type
          (identifier)))
      (table_column
        (identifier)
        (type
          (identifier)))))
  (create_table_statement
    (identifier)
    (table_parameters))
  (create_table_statement
    (identifier)
    (table_parameters
      (table_column
        (identifier)
        (type
          (identifier)))
      (table_column
        (identifier)
        (type
          (identifier))))))

================================================================================
CREATE TABLE with timestamp
================================================================================

CREATE TABLE public.my_table (
    col1 INT PRIMARY KEY,
    created_at timestamp(6) without time zone NOT NULL,
    updated_at timestamp(6) without time zone NOT NULL DEFAULT (now() + INTERVAL '1 second')
);

--------------------------------------------------------------------------------

(source_file
  (create_table_statement
    (dotted_name
      (identifier)
      (identifier))
    (table_parameters
      (table_column
        (identifier)
        (type
          (identifier))
        (primary_key_constraint))
      (table_column
        (identifier)
        (type
          (identifier)
          (number))
        (null_constraint
          (NULL)))
      (table_column
        (identifier)
        (type
          (identifier)
          (number))
        (null_constraint
          (NULL))
        (default_clause
          (binary_expression
            (function_call
              (identifier))
            (interval_expression
              (string
                (content)))))))))

================================================================================
CREATE TABLE with not null constraint
================================================================================

CREATE TABLE my_table (col1 INT NOT NULL)

--------------------------------------------------------------------------------

(source_file
  (create_table_statement
    (identifier)
    (table_parameters
      (table_column
        (identifier)
        (type
          (identifier))
        (null_constraint
          (NULL))))))

================================================================================
CREATE TABLE with default
================================================================================

CREATE TABLE my_table (col1 INT DEFAULT get_num())

--------------------------------------------------------------------------------

(source_file
  (create_table_statement
    (identifier)
    (table_parameters
      (table_column
        (identifier)
        (type
          (identifier))
        (default_clause
          (function_call
            (identifier)))))))

================================================================================
CREATE TABLE with default string
================================================================================

CREATE TABLE my_table (col1 INT DEFAULT 'hey')

--------------------------------------------------------------------------------

(source_file
  (create_table_statement
    (identifier)
    (table_parameters
      (table_column
        (identifier)
        (type
          (identifier))
        (default_clause
          (string
            (content)))))))

================================================================================
CREATE TABLE with primary key constraint
================================================================================

CREATE TABLE my_table (col1 INT PRIMARY KEY)

--------------------------------------------------------------------------------

(source_file
  (create_table_statement
    (identifier)
    (table_parameters
      (table_column
        (identifier)
        (type
          (identifier))
        (primary_key_constraint)))))

================================================================================
CREATE TABLE with references constraint
================================================================================

CREATE TABLE my_table (col1 INT REFERENCES table1)

--------------------------------------------------------------------------------

(source_file
  (create_table_statement
    (identifier)
    (table_parameters
      (table_column
        (identifier)
        (type
          (identifier))
        (references_constraint
          (identifier))))))

================================================================================
CREATE TABLE with references constraint with column specified
================================================================================

CREATE TABLE my_table (col1 INT REFERENCES table1(col1))

--------------------------------------------------------------------------------

(source_file
  (create_table_statement
    (identifier)
    (table_parameters
      (table_column
        (identifier)
        (type
          (identifier))
        (references_constraint
          (identifier)
          (identifier_list
            (identifier)))))))

================================================================================
CREATE TABLE with references constraint with actions
================================================================================

CREATE TABLE my_table (col1 INT REFERENCES table1(col1) ON DELETE SET NULL ON UPDATE RESTRICT)

--------------------------------------------------------------------------------

(source_file
  (create_table_statement
    (identifier)
    (table_parameters
      (table_column
        (identifier)
        (type
          (identifier))
        (references_constraint
          (identifier)
          (identifier_list
            (identifier))
          (on_delete_action)
          (on_update_action))))))

================================================================================
CREATE TABLE with unique constraint
================================================================================

CREATE TABLE my_table (col1 INT UNIQUE)

--------------------------------------------------------------------------------

(source_file
  (create_table_statement
    (identifier)
    (table_parameters
      (table_column
        (identifier)
        (type
          (identifier))
        (unique_constraint)))))

================================================================================
CREATE TABLE with multiple constaints
================================================================================

CREATE TABLE my_table (col1 INT DEFAULT get_val() NOT NULL)

--------------------------------------------------------------------------------

(source_file
  (create_table_statement
    (identifier)
    (table_parameters
      (table_column
        (identifier)
        (type
          (identifier))
        (default_clause
          (function_call
            (identifier)))
        (null_constraint
          (NULL))))))

================================================================================
CREATE TABLE with check in constaint, rule precedence
================================================================================

CREATE TABLE my_table (col1 INT CHECK(col1 IN (1, 2)));

--------------------------------------------------------------------------------

(source_file
  (create_table_statement
    (identifier)
    (table_parameters
      (table_column
        (identifier)
        (type
          (identifier))
        (check_constraint
          (in_expression
            (identifier)
            (tuple
              (number)
              (number))))))))

================================================================================
CREATE TABLE with foreign key constraint
================================================================================

CREATE TABLE my_table (
    col1 INT,
    col2 INT,
    FOREIGN KEY (col1, col2) REFERENCES mytable2,
    CONSTRAINT my_key FOREIGN KEY (col1, col2) REFERENCES mytable2
);

--------------------------------------------------------------------------------

(source_file
  (create_table_statement
    (identifier)
    (table_parameters
      (table_column
        (identifier)
        (type
          (identifier)))
      (table_column
        (identifier)
        (type
          (identifier)))
      (foreign_key
        (column_names
          (identifier)
          (identifier))
        (references_constraint
          (identifier)))
      (identifier)
      (foreign_key
        (column_names
          (identifier)
          (identifier))
        (references_constraint
          (identifier))))))

================================================================================
CREATE TABLE with multiple constraints
================================================================================

CREATE TABLE foo(
  col1 INT NOT NULL REFERENCES bar(col1) ON UPDATE CASCADE ON DELETE CASCADE,
  col2 INT NOT NULL REFERENCES bar ON UPDATE CASCADE,
  col3 INT NOT NULL REFERENCES bar ON DELETE CASCADE
)

--------------------------------------------------------------------------------

(source_file
  (create_table_statement
    (identifier)
    (table_parameters
      (table_column
        (identifier)
        (type
          (identifier))
        (null_constraint
          (NULL))
        (references_constraint
          (identifier)
          (identifier_list
            (identifier))
          (on_update_action)
          (on_delete_action)))
      (table_column
        (identifier)
        (type
          (identifier))
        (null_constraint
          (NULL))
        (references_constraint
          (identifier)
          (on_update_action)))
      (table_column
        (identifier)
        (type
          (identifier))
        (null_constraint
          (NULL))
        (references_constraint
          (identifier)
          (on_delete_action))))))

================================================================================
CREATE TABLE with unique constraint
================================================================================

CREATE TABLE foo(col1 INT, col2 INT, UNIQUE(col1, col2))

--------------------------------------------------------------------------------

(source_file
  (create_table_statement
    (identifier)
    (table_parameters
      (table_column
        (identifier)
        (type
          (identifier)))
      (table_column
        (identifier)
        (type
          (identifier)))
      (unique
        (column_names
          (identifier)
          (identifier))))))

================================================================================
CREATE TABLE with direction
================================================================================

CREATE TABLE foo(
  id BIGINT NOT NULL PRIMARY KEY,
	date DATE DEFAULT NULL ASC
);

--------------------------------------------------------------------------------

(source_file
  (create_table_statement
    (identifier)
    (table_parameters
      (table_column
        (identifier)
        (type
          (identifier))
        (null_constraint
          (NULL))
        (primary_key_constraint))
      (table_column
        (identifier)
        (type
          (identifier))
        (default_clause
          (identifier))
        (order)))))

================================================================================
Comment
================================================================================

-- Smile and wave

--------------------------------------------------------------------------------

(source_file
  (comment))

================================================================================
Multiline comment
================================================================================

/*
Smile and wave
*/

--------------------------------------------------------------------------------

(source_file
  (comment))

================================================================================
CREATE TABLE with named constraint
================================================================================

CREATE TABLE foo(col1 INT CONSTRAINT col1_constraint)

--------------------------------------------------------------------------------

(source_file
  (create_table_statement
    (identifier)
    (table_parameters
      (table_column
        (identifier)
        (type
          (identifier))
        (named_constraint
          (identifier))))))

================================================================================
CREATE TABLE with composite primary key
================================================================================

CREATE TABLE foo(col1 INT, col2 INT, PRIMARY KEY(col1, col2))

--------------------------------------------------------------------------------

(source_file
  (create_table_statement
    (identifier)
    (table_parameters
      (table_column
        (identifier)
        (type
          (identifier)))
      (table_column
        (identifier)
        (type
          (identifier)))
      (primary_key
        (column_names
          (identifier)
          (identifier))))))

================================================================================
CREATE TABLE with exclude contraint
================================================================================

CREATE TABLE foo(col1 INT, col2 VARCHAR, EXCLUDE USING GIST (col1 WITH =, col2 varchar_pattern_ops WITH &&))

--------------------------------------------------------------------------------

(source_file
  (create_table_statement
    (identifier)
    (table_parameters
      (table_column
        (identifier)
        (type
          (identifier)))
      (table_column
        (identifier)
        (type
          (identifier)))
      (exclude
        (identifier)
        (exclude_entry
          (identifier)
          (binary_operator))
        (exclude_entry
          (identifier)
          (op_class
            (identifier))
          (binary_operator))))))

================================================================================
CREATE TABLE with array type column
================================================================================

CREATE TABLE foo(col1 INT[])

--------------------------------------------------------------------------------

(source_file
  (create_table_statement
    (identifier)
    (table_parameters
      (table_column
        (identifier)
        (array_type
          (type
            (identifier)))))))

================================================================================
CREATE TABLE with check constraint
================================================================================

CREATE TABLE foo(
  col1 INT,
  col2 INT,
  CHECK(col1 > col2),
  CONSTRAINT mycheck CHECK (func(start) = interval '5 minutes')
)

--------------------------------------------------------------------------------

(source_file
  (create_table_statement
    (identifier)
    (table_parameters
      (table_column
        (identifier)
        (type
          (identifier)))
      (table_column
        (identifier)
        (type
          (identifier)))
      (check
        (binary_expression
          (identifier)
          (identifier)))
      (identifier)
      (check
        (binary_expression
          (function_call
            (identifier)
            (identifier))
          (interval_expression
            (string
              (content))))))))

================================================================================
CREATE TABLE with foreign key constraint with columns specified
================================================================================

CREATE TABLE my_table (
    col1 INT,
    col2 INT,
    FOREIGN KEY (col1, col2) REFERENCES mytable2(col1, col2)
);

--------------------------------------------------------------------------------

(source_file
  (create_table_statement
    (identifier)
    (table_parameters
      (table_column
        (identifier)
        (type
          (identifier)))
      (table_column
        (identifier)
        (type
          (identifier)))
      (foreign_key
        (column_names
          (identifier)
          (identifier))
        (references_constraint
          (identifier)
          (identifier_list
            (identifier)
            (identifier)))))))

================================================================================
CREATE FUNCTION
================================================================================

CREATE FUNCTION add(integer, integer) RETURNS integer
    AS 'select $1 + $2;'
    LANGUAGE SQL;
CREATE FUNCTION add(integer, integer) RETURNS integer
    AS $BODY$select $1 + $2;$BODY$
    LANGUAGE SQL;

--------------------------------------------------------------------------------

(source_file
  (create_function_statement
    (identifier)
    (create_function_parameters
      (create_function_parameter
        (type
          (identifier)))
      (create_function_parameter
        (type
          (identifier))))
    (type
      (identifier))
    (function_body
      (string
        (content)))
    (language))
  (create_function_statement
    (identifier)
    (create_function_parameters
      (create_function_parameter
        (type
          (identifier)))
      (create_function_parameter
        (type
          (identifier))))
    (type
      (identifier))
    (function_body
      (string
        (content)))
    (language)))

================================================================================
CREATE OR REPLACE FUNCTION
================================================================================

CREATE OR REPLACE FUNCTION add(integer, integer) RETURNS integer
    AS 'select $1 + $2;'
    LANGUAGE SQL;

--------------------------------------------------------------------------------

(source_file
  (create_function_statement
    (identifier)
    (create_function_parameters
      (create_function_parameter
        (type
          (identifier)))
      (create_function_parameter
        (type
          (identifier))))
    (type
      (identifier))
    (function_body
      (string
        (content)))
    (language)))

================================================================================
CREATE FUNCTION hints
================================================================================

CREATE FUNCTION foo(int) RETURNS integer
    AS 'select 1'
    LANGUAGE SQL STRICT IMMUTABLE PARALLEL SAFE;

--------------------------------------------------------------------------------

(source_file
  (create_function_statement
    (identifier)
    (create_function_parameters
      (create_function_parameter
        (type
          (identifier))))
    (type
      (identifier))
    (function_body
      (string
        (content)))
    (language)
    (null_hint)
    (optimizer_hint)
    (parallel_hint)))

================================================================================
CREATE FUNCTION argmode
================================================================================

CREATE FUNCTION add(IN int, OUT int, INOUT int, VARIADIC int) RETURNS int
    AS 'select col2 from table where col1 = $1;'
    LANGUAGE SQL;

--------------------------------------------------------------------------------

(source_file
  (create_function_statement
    (identifier)
    (create_function_parameters
      (create_function_parameter
        (type
          (identifier)))
      (create_function_parameter
        (type
          (identifier)))
      (create_function_parameter
        (type
          (identifier)))
      (create_function_parameter
        (type
          (identifier))))
    (type
      (identifier))
    (function_body
      (string
        (content)))
    (language)))

================================================================================
CREATE FUNCTION returns setof
================================================================================

CREATE FUNCTION add(text) RETURNS SETOF int
    AS 'select col2 from table where col1 = $1;'
    LANGUAGE SQL;

--------------------------------------------------------------------------------

(source_file
  (create_function_statement
    (identifier)
    (create_function_parameters
      (create_function_parameter
        (type
          (identifier))))
    (setof
      (type
        (identifier)))
    (function_body
      (string
        (content)))
    (language)))

================================================================================
CREATE FUNCTION returns constrained setof
================================================================================

CREATE FUNCTION add(text) RETURNS SETOF int NOT NULL
    AS 'select col2 from table where col1 = $1;'
    LANGUAGE SQL;

--------------------------------------------------------------------------------

(source_file
  (create_function_statement
    (identifier)
    (create_function_parameters
      (create_function_parameter
        (type
          (identifier))))
    (setof
      (constrained_type
        (type
          (identifier))
        (null_constraint
          (NULL))))
    (function_body
      (string
        (content)))
    (language)))

================================================================================
CREATE FUNCTION Language in first pos
================================================================================

CREATE FUNCTION add(integer) RETURNS integer LANGUAGE SQL AS 'select $1';

--------------------------------------------------------------------------------

(source_file
  (create_function_statement
    (identifier)
    (create_function_parameters
      (create_function_parameter
        (type
          (identifier))))
    (type
      (identifier))
    (language)
    (function_body
      (string
        (content)))))

================================================================================
CREATE FUNCTION with optimizer hint
================================================================================

CREATE FUNCTION add(integer) RETURNS integer STABLE LANGUAGE SQL AS 'select $1';

--------------------------------------------------------------------------------

(source_file
  (create_function_statement
    (identifier)
    (create_function_parameters
      (create_function_parameter
        (type
          (identifier))))
    (type
      (identifier))
    (optimizer_hint)
    (language)
    (function_body
      (string
        (content)))))

================================================================================
CREATE FUNCTION with constrained args
================================================================================

CREATE FUNCTION add(integer NOT NULL) RETURNS integer STABLE LANGUAGE SQL AS 'select $1';

--------------------------------------------------------------------------------

(source_file
  (create_function_statement
    (identifier)
    (create_function_parameters
      (create_function_parameter
        (constrained_type
          (type
            (identifier))
          (null_constraint
            (NULL)))))
    (type
      (identifier))
    (optimizer_hint)
    (language)
    (function_body
      (string
        (content)))))

================================================================================
CREATE FUNCTION lowercase
================================================================================

create function add(integer) returns integer language sql as 'select $1';

--------------------------------------------------------------------------------

(source_file
  (create_function_statement
    (identifier)
    (create_function_parameters
      (create_function_parameter
        (type
          (identifier))))
    (type
      (identifier))
    (language)
    (function_body
      (string
        (content)))))

================================================================================
CREATE FUNCTION highlight function body
================================================================================

create function add(integer) returns integer language sql as 'select a, b';

--------------------------------------------------------------------------------

(source_file
  (create_function_statement
    (identifier)
    (create_function_parameters
      (create_function_parameter
        (type
          (identifier))))
    (type
      (identifier))
    (language)
    (function_body
      (string
        (content)))))

================================================================================
CREATE SCHEMA schema
================================================================================

CREATE SCHEMA information_schema;
CREATE SCHEMA IF NOT EXISTS information_schema;

--------------------------------------------------------------------------------

(source_file
  (create_schema_statement
    (identifier))
  (create_schema_statement
    (if_not_exists)
    (identifier)))

================================================================================
GRANT
================================================================================

GRANT USAGE ON SCHEMA information_schema TO PUBLIC;

--------------------------------------------------------------------------------

(source_file
  (grant_statement
    (identifier)))

================================================================================
SET
================================================================================

SET search_path TO information_schema;
SET search_path TO 'test';
SET LOCAL search_path TO 'test';
SET SESSION search_path TO 'test';
SET SESSION search_path = 'test';

--------------------------------------------------------------------------------

(source_file
  (set_statement
    (identifier)
    (identifier))
  (set_statement
    (identifier)
    (string
      (content)))
  (set_statement
    (identifier)
    (string
      (content)))
  (set_statement
    (identifier)
    (string
      (content)))
  (set_statement
    (identifier)
    (string
      (content))))

================================================================================
SELECT asterisk expressions
================================================================================

SELECT * FROM Customers;
SELECT a.* FROM Customers;
SELECT COUNT(*) FROM Customers;
SELECT COUNT(a.*) FROM Customers;

--------------------------------------------------------------------------------

(source_file
  (select_statement
    (select_clause
      (select_clause_body
        (asterisk_expression)))
    (from_clause
      (identifier)))
  (select_statement
    (select_clause
      (select_clause_body
        (asterisk_expression
          (identifier))))
    (from_clause
      (identifier)))
  (select_statement
    (select_clause
      (select_clause_body
        (function_call
          (identifier)
          (asterisk_expression))))
    (from_clause
      (identifier)))
  (select_statement
    (select_clause
      (select_clause_body
        (function_call
          (identifier)
          (asterisk_expression
            (identifier)))))
    (from_clause
      (identifier))))

================================================================================
CREATE EXTENSION
================================================================================

CREATE EXTENSION postgis;
CREATE EXTENSION IF NOT EXISTS postgis;
CREATE EXTENSION IF NOT EXISTS postgis SCHEMA bar;
CREATE EXTENSION IF NOT EXISTS postgis WITH SCHEMA bar;
CREATE EXTENSION IF NOT EXISTS postgis VERSION '1.0';
CREATE EXTENSION IF NOT EXISTS postgis WITH VERSION '1.0' SCHEMA bar;
CREATE EXTENSION IF NOT EXISTS postgis VERSION '1.0' SCHEMA bar CASCADE;
CREATE EXTENSION btree_gist SCHEMA test_schema_diff;

--------------------------------------------------------------------------------

(source_file
  (create_extension_statement
    (identifier))
  (create_extension_statement
    (if_not_exists)
    (identifier))
  (create_extension_statement
    (if_not_exists)
    (identifier)
    (schema
      (identifier)))
  (create_extension_statement
    (if_not_exists)
    (identifier)
    (schema
      (identifier)))
  (create_extension_statement
    (if_not_exists)
    (identifier)
    (version
      (content)))
  (create_extension_statement
    (if_not_exists)
    (identifier)
    (version
      (content))
    (schema
      (identifier)))
  (create_extension_statement
    (if_not_exists)
    (identifier)
    (version
      (content))
    (schema
      (identifier)))
  (create_extension_statement
    (identifier)
    (schema
      (identifier))))

================================================================================
CREATE ROLE
================================================================================

CREATE ROLE regress_lr_normal;
CREATE ROLE regress_lr_superuser SUPERUSER;
CREATE ROLE regress_lr_replication REPLICATION;
CREATE ROLE regress_origin_replication REPLICATION;

--------------------------------------------------------------------------------

(source_file
  (create_role_statement
    (identifier))
  (create_role_statement
    (identifier)
    (identifier))
  (create_role_statement
    (identifier)
    (identifier))
  (create_role_statement
    (identifier)
    (identifier)))

================================================================================
DROP
================================================================================

DROP TABLE IF EXISTS foo;
DROP TABLE foo;
DROP VIEW bar;
DROP TABLESPACE bar;
DROP EXTENSION postgis;
DROP TABLE foo CASCADE;
DROP TABLE foo RESTRICT;
DROP TABLE tb1, tb2, tb3;
DROP MATERIALIZED VIEW bar;
DROP INDEX idx;
DROP INDEX CONCURRENTLY idx;

--------------------------------------------------------------------------------

(source_file
  (drop_statement
    (if_exists)
    (identifier))
  (drop_statement
    (identifier))
  (drop_statement
    (identifier))
  (drop_statement
    (identifier))
  (drop_statement
    (identifier))
  (drop_statement
    (identifier))
  (drop_statement
    (identifier))
  (drop_statement
    (identifier)
    (identifier)
    (identifier))
  (drop_statement
    (identifier))
  (drop_statement
    (identifier))
  (drop_statement
    (identifier)))

================================================================================
DROP
================================================================================

DROP TABLE IF EXISTS foo;
DROP TABLE foo;
DROP VIEW bar;
DROP INDEX baz;
DROP TABLESPACE bar;
DROP EXTENSION postgis;

--------------------------------------------------------------------------------

(source_file
  (drop_statement
    (if_exists)
    (identifier))
  (drop_statement
    (identifier))
  (drop_statement
    (identifier))
  (drop_statement
    (identifier))
  (drop_statement
    (identifier))
  (drop_statement
    (identifier)))

================================================================================
Postgres command
================================================================================

\echo Use "CREATE EXTENSION foo" to load this file.

--------------------------------------------------------------------------------

(source_file
  (pg_command))

================================================================================
SEQUENCE
================================================================================

CREATE TEMP SEQUENCE myseq0;
CREATE TEMPORARY SEQUENCE myseq1;
CREATE SEQUENCE IF NOT EXISTS myseq2;
CREATE SEQUENCE myseq3;
CREATE SEQUENCE myseq4 AS integer;
CREATE SEQUENCE myseq5 START WITH 10 INCREMENT BY 10 NO MINVALUE NO MAXVALUE CACHE 1;
CREATE SEQUENCE myseq6 OWNED BY user;
CREATE SEQUENCE myseq6 OWNED BY foo.bar;
ALTER SEQUENCE myseq3 OWNED BY user;
ALTER SEQUENCE IF EXISTS myseq2 START WITH 10 INCREMENT BY 10 NO MINVALUE NO MAXVALUE CACHE 1;

--------------------------------------------------------------------------------

(source_file
  (create_statement
    (create_sequence
      (identifier)))
  (create_statement
    (create_sequence
      (identifier)))
  (create_statement
    (create_sequence
      (identifier)))
  (create_statement
    (create_sequence
      (identifier)))
  (create_statement
    (create_sequence
      (identifier)
      (type
        (identifier))))
  (create_statement
    (create_sequence
      (identifier)
      (start_with
        (number))
      (increament_by
        (number))
      (no_minvalue)
      (no_maxvalue)
      (cache
        (number))))
  (create_statement
    (create_sequence
      (identifier)
      (owned_by
        (identifier))))
  (create_statement
    (create_sequence
      (identifier)
      (owned_by
        (dotted_name
          (identifier)
          (identifier)))))
  (alter_statement
    (alter_sequence
      (identifier)
      (owned_by
        (identifier))))
  (alter_statement
    (alter_sequence
      (identifier)
      (start_with
        (number))
      (increament_by
        (number))
      (no_minvalue)
      (no_maxvalue)
      (cache
        (number)))))

================================================================================
ALTER TABLE
================================================================================

ALTER TABLE ONLY foo ALTER COLUMN myid SET DEFAULT nextval('myseq0'::regclass);
ALTER TABLE bar
    ADD COLUMN col1 UUID REFERENCES baz (col1) ON UPDATE CASCADE ON DELETE SET NULL;
ALTER TABLE bar
    ADD COLUMN col1 TEXT DEFAULT 0::text NOT NULL;
ALTER TABLE mytable0
    ADD FOREIGN KEY (mykey) REFERENCES mytable1 (col1_id)
      ON UPDATE CASCADE ON DELETE RESTRICT INITIALLY DEFERRED;
ALTER TABLE foo SET (autovacuum_enabled = false);
ALTER TABLE foo RENAME COLUMN bar TO baz;
ALTER TABLE foo OWNER TO bar;

ALTER TABLE foo RENAME CONSTRAINT bar TO baz;
ALTER TABLE foo RENAME TO bar;
ALTER TABLE foo SET SCHEMA bar;
ALTER TABLE foo ATTACH PARTITION bar FOR VALUES IN (1, 1 + 1);
ALTER TABLE foo ATTACH PARTITION bar FOR VALUES FROM (1, 1 + 1) TO (2, 2 * 2);
ALTER TABLE foo ATTACH PARTITION bar FOR VALUES WITH ( MODULUS 2, REMAINDER 5 );
ALTER TABLE foo DETACH PARTITION bar CONCURRENTLY;
ALTER TABLE foo DROP COLUMN IF EXISTS bar RESTRICT;
ALTER TABLE foo ALTER COLUMN bar SET DATA TYPE INTEGER COLLATE collation USING bar::text;
ALTER TABLE foo ALTER COLUMN bar SET DEFAULT max(bar, baz);
ALTER TABLE foo ALTER COLUMN bar SET DEFAULT 1::NUMERIC;
ALTER TABLE foo ALTER COLUMN bar DROP DEFAULT;
ALTER TABLE foo ALTER COLUMN bar SET NOT NULL;
ALTER TABLE foo ALTER COLUMN bar DROP NOT NULL;
ALTER TABLE foo ALTER COLUMN bar DROP EXPRESSION IF EXISTS;
ALTER TABLE foo ALTER COLUMN bar ADD GENERATED BY DEFAULT AS IDENTITY (INCREMENT BY 2 MINVALUE 0 MAXVALUE 10 START WITH 0);
ALTER TABLE foo ALTER COLUMN bar SET GENERATED ALWAYS SET MINVALUE 1 RESTART WITH 1;
ALTER TABLE foo ALTER COLUMN bar DROP IDENTITY IF EXISTS;
ALTER TABLE foo ALTER COLUMN bar SET STATISTICS 3;
ALTER TABLE foo ALTER COLUMN bar SET (a=1, b='b', c=ARRAY[1,2]);
ALTER TABLE foo ALTER COLUMN bar RESET (a, b, c);
ALTER TABLE foo ALTER COLUMN bar SET STORAGE EXTENDED;
ALTER TABLE foo ALTER COLUMN bar SET COMPRESSION comp_func;
ALTER TABLE foo ALTER CONSTRAINT bar NOT DEFERRABLE INITIALLY DEFERRED;
ALTER TABLE foo VALIDATE CONSTRAINT bar;
ALTER TABLE foo DROP CONSTRAINT IF EXISTS bar RESTRICT;
ALTER TABLE foo DISABLE TRIGGER trigger1;
ALTER TABLE foo ENABLE TRIGGER trigger1;
ALTER TABLE foo ENABLE REPLICA TRIGGER trigger1;
ALTER TABLE foo ENABLE ALWAYS TRIGGER trigger1;
ALTER TABLE foo DISABLE RULE rule1;
ALTER TABLE foo ENABLE RULE rule1;
ALTER TABLE foo ENABLE REPLICA RULE rule1;
ALTER TABLE foo ENABLE ALWAYS RULE rule1;
ALTER TABLE foo DISABLE ROW LEVEL SECURITY;
ALTER TABLE foo ENABLE ROW LEVEL SECURITY;
ALTER TABLE foo FORCE ROW LEVEL SECURITY;
ALTER TABLE foo NO FORCE ROW LEVEL SECURITY;
ALTER TABLE foo CLUSTER ON idx1;
ALTER TABLE foo SET WITHOUT CLUSTER;
ALTER TABLE foo SET WITHOUT OIDS;
ALTER TABLE foo SET TABLESPACE tbsp;
ALTER TABLE foo SET LOGGED;
ALTER TABLE foo SET UNLOGGED;
ALTER TABLE foo SET (storage_parameter1=1, storage_parameter2=2);
ALTER TABLE foo RESET (storage_parameter1, storage_parameter2);
ALTER TABLE foo INHERIT parent;
ALTER TABLE foo NO INHERIT parent;
ALTER TABLE foo OF typename;
ALTER TABLE foo NOT OF;
ALTER TABLE foo REPLICA IDENTITY DEFAULT;
ALTER TABLE foo REPLICA IDENTITY NOTHING;
ALTER TABLE foo REPLICA IDENTITY USING INDEX idx1;
ALTER TABLE foo REPLICA IDENTITY FULL;

ALTER TABLE foo
  REPLICA IDENTITY FULL,
  ALTER CONSTRAINT bar NOT DEFERRABLE INITIALLY DEFERRED,
  ALTER COLUMN bar SET GENERATED ALWAYS SET MINVALUE 1 RESTART WITH 1;

--------------------------------------------------------------------------------

(source_file
  (alter_table_statement
    (identifier)
    (alter_column
      (identifier)
      (set_default
        (function_call
          (identifier)
          (type_cast
            (string
              (content))
            (type
              (identifier)))))))
  (alter_table_statement
    (identifier)
    (add_column
      (table_column
        (identifier)
        (type
          (identifier))
        (references_constraint
          (identifier)
          (identifier_list
            (identifier))
          (on_update_action)
          (on_delete_action)))))
  (alter_table_statement
    (identifier)
    (add_column
      (table_column
        (identifier)
        (type
          (identifier))
        (default_clause
          (type_cast
            (number)
            (type
              (identifier))))
        (null_constraint
          (NULL)))))
  (alter_table_statement
    (identifier)
    (add_table_constraint
      (foreign_key
        (column_names
          (identifier))
        (references_constraint
          (identifier)
          (identifier_list
            (identifier))
          (on_update_action)
          (on_delete_action)))
      (initial_mode)))
  (alter_table_statement
    (identifier)
    (set_storage_parameters
      (assignment_expression_list
        (assignment_expression
          (identifier)
          (FALSE)))))
  (alter_table_statement
    (identifier)
    (rename_column
      (identifier)
      (identifier)))
  (alter_table_statement
    (identifier)
    (owner_to
      (identifier)))
  (alter_table_statement
    (identifier)
    (rename_constraint
      (identifier)
      (identifier)))
  (alter_table_statement
    (identifier)
    (rename_to
      (identifier)))
  (alter_table_statement
    (identifier)
    (set_schema
      (identifier)))
  (alter_table_statement
    (identifier)
    (attach_partition
      (identifier)
      (partition_bound
        (partition_bound_in
          (expression_list
            (number)
            (binary_expression
              (number)
              (number)))))))
  (alter_table_statement
    (identifier)
    (attach_partition
      (identifier)
      (partition_bound
        (partition_bound_from_to
          (number)
          (binary_expression
            (number)
            (number))
          (number)
          (binary_expression
            (number)
            (number))))))
  (alter_table_statement
    (identifier)
    (attach_partition
      (identifier)
      (partition_bound
        (partition_bound_with
          (modulus
            (number))
          (remainder
            (number))))))
  (alter_table_statement
    (identifier)
    (detach_partition
      (identifier)))
  (alter_table_statement
    (identifier)
    (drop_column
      (if_exists)
      (identifier)
      (relationship_behavior)))
  (alter_table_statement
    (identifier)
    (alter_column
      (identifier)
      (set_data_type
        (type
          (identifier)))
      (collate
        (identifier))
      (using_expression
        (type_cast
          (identifier)
          (type
            (identifier))))))
  (alter_table_statement
    (identifier)
    (alter_column
      (identifier)
      (set_default
        (function_call
          (identifier)
          (identifier)
          (identifier)))))
  (alter_table_statement
    (identifier)
    (alter_column
      (identifier)
      (set_default
        (type_cast
          (number)
          (type
            (identifier))))))
  (alter_table_statement
    (identifier)
    (alter_column
      (identifier)
      (drop_default)))
  (alter_table_statement
    (identifier)
    (alter_column
      (identifier)
      (set_not_null)))
  (alter_table_statement
    (identifier)
    (alter_column
      (identifier)
      (drop_not_null)))
  (alter_table_statement
    (identifier)
    (alter_column
      (identifier)
      (drop_expression
        (if_exists))))
  (alter_table_statement
    (identifier)
    (alter_column
      (identifier)
      (add_generated
        (increament_by
          (number))
        (minvalue
          (number))
        (maxvalue
          (number))
        (start_with
          (number)))))
  (alter_table_statement
    (identifier)
    (alter_column
      (identifier)
      (set_generated)
      (set_sequence_option
        (minvalue
          (number)))
      (restart_with
        (number))))
  (alter_table_statement
    (identifier)
    (alter_column
      (identifier)
      (drop_identity
        (if_exists))))
  (alter_table_statement
    (identifier)
    (alter_column
      (identifier)
      (set_statistics
        (number))))
  (alter_table_statement
    (identifier)
    (alter_column
      (identifier)
      (set_attribute_options
        (assignment_expression_list
          (assignment_expression
            (identifier)
            (number))
          (assignment_expression
            (identifier)
            (string
              (content)))
          (assignment_expression
            (identifier)
            (array_constructor
              (number)
              (number)))))))
  (alter_table_statement
    (identifier)
    (alter_column
      (identifier)
      (reset_attribute_options
        (attribute_options
          (identifier)
          (identifier)
          (identifier)))))
  (alter_table_statement
    (identifier)
    (alter_column
      (identifier)
      (set_storage)))
  (alter_table_statement
    (identifier)
    (alter_column
      (identifier)
      (set_compression
        (identifier))))
  (alter_table_statement
    (identifier)
    (alter_constraint
      (identifier)
      (not_deferrable)
      (initially_deferred)))
  (alter_table_statement
    (identifier)
    (validata_constraint
      (identifier)))
  (alter_table_statement
    (identifier)
    (drop_constraint
      (if_exists)
      (identifier)
      (relationship_behavior)))
  (alter_table_statement
    (identifier)
    (disable_trigger
      (identifier)))
  (alter_table_statement
    (identifier)
    (enable_trigger
      (identifier)))
  (alter_table_statement
    (identifier)
    (enable_trigger
      (identifier)))
  (alter_table_statement
    (identifier)
    (enable_trigger
      (identifier)))
  (alter_table_statement
    (identifier)
    (disable_rule
      (identifier)))
  (alter_table_statement
    (identifier)
    (enable_rule
      (identifier)))
  (alter_table_statement
    (identifier)
    (enable_rule
      (identifier)))
  (alter_table_statement
    (identifier)
    (enable_rule
      (identifier)))
  (alter_table_statement
    (identifier)
    (disable_row_level_security))
  (alter_table_statement
    (identifier)
    (enable_row_level_security))
  (alter_table_statement
    (identifier)
    (force_row_level_security))
  (alter_table_statement
    (identifier)
    (no_force_row_level_security))
  (alter_table_statement
    (identifier)
    (cluster_on
      (identifier)))
  (alter_table_statement
    (identifier)
    (set_without_cluster))
  (alter_table_statement
    (identifier)
    (set_without_oids))
  (alter_table_statement
    (identifier)
    (set_tablespace
      (identifier)))
  (alter_table_statement
    (identifier)
    (set_logged))
  (alter_table_statement
    (identifier)
    (set_unlogged))
  (alter_table_statement
    (identifier)
    (set_storage_parameters
      (assignment_expression_list
        (assignment_expression
          (identifier)
          (number))
        (assignment_expression
          (identifier)
          (number)))))
  (alter_table_statement
    (identifier)
    (reset_storage_parameters
      (identifier_list
        (identifier)
        (identifier))))
  (alter_table_statement
    (identifier)
    (inherit
      (identifier)))
  (alter_table_statement
    (identifier)
    (no_inherit
      (identifier)))
  (alter_table_statement
    (identifier)
    (of_type
      (type
        (identifier))))
  (alter_table_statement
    (identifier)
    (not_of))
  (alter_table_statement
    (identifier)
    (replica_identity))
  (alter_table_statement
    (identifier)
    (replica_identity))
  (alter_table_statement
    (identifier)
    (replica_identity
      (identifier)))
  (alter_table_statement
    (identifier)
    (replica_identity))
  (alter_table_statement
    (identifier)
    (replica_identity)
    (alter_constraint
      (identifier)
      (not_deferrable)
      (initially_deferred))
    (alter_column
      (identifier)
      (set_generated)
      (set_sequence_option
        (minvalue
          (number)))
      (restart_with
        (number)))))

================================================================================
Transaction operators
================================================================================

BEGIN;
BEGIN WORK;
BEGIN TRANSACTION;
COMMIT;
COMMIT WORK;
COMMIT TRANSACTION;
ROLLBACK;
ROLLBACK WORK;
ROLLBACK TRANSACTION;

--------------------------------------------------------------------------------

(source_file
  (begin_statement)
  (begin_statement)
  (begin_statement)
  (commit_statement)
  (commit_statement)
  (commit_statement)
  (rollback_statement)
  (rollback_statement)
  (rollback_statement))

================================================================================
Quoting identifiers and dotted access
================================================================================

SELECT "test1s adfadf sf !!@#",
        "test1s adfadf sf !!@#".*,
        public."test1s adfadf sf !!@#",
        "public"."test1s adfadf sf !!@#",
        "public"."test1s adfadf sf !!@#".*,
        "my schema".test,
        "my schema".test.*;

SELECT a.`test 1`;

--------------------------------------------------------------------------------

(source_file
  (select_statement
    (select_clause
      (select_clause_body
        (identifier)
        (asterisk_expression
          (identifier))
        (dotted_name
          (identifier)
          (identifier))
        (dotted_name
          (identifier)
          (identifier))
        (asterisk_expression
          (dotted_name
            (identifier)
            (identifier)))
        (dotted_name
          (identifier)
          (identifier))
        (asterisk_expression
          (dotted_name
            (identifier)
            (identifier))))))
  (select_statement
    (select_clause
      (select_clause_body
        (dotted_name
          (identifier)
          (identifier))))))

================================================================================
Dollar quoted strings
================================================================================

SELECT $$a$$, $a$baz$a$, $a$$$$a$, $a$b$$a$, $TAG$afasf    $$TAG$;

--------------------------------------------------------------------------------

(source_file
  (select_statement
    (select_clause
      (select_clause_body
        (string
          (content))
        (string
          (content))
        (string
          (content))
        (string
          (content))
        (string
          (content))))))

================================================================================
CASE
================================================================================

SELECT a,
  CASE WHEN a=1 THEN 'one'
      WHEN a=2 THEN 'two'
      ELSE 'other'
  END
FROM foo;

--------------------------------------------------------------------------------

(source_file
  (select_statement
    (select_clause
      (select_clause_body
        (identifier)
        (conditional_expression
          (binary_expression
            (identifier)
            (number))
          (string
            (content))
          (binary_expression
            (identifier)
            (number))
          (string
            (content))
          (string
            (content)))))
    (from_clause
      (identifier))))

================================================================================
Escaping quotes
================================================================================

SELECT 'O''Connor', '''', '''''', ' '' ', ' '' a'' ';

--------------------------------------------------------------------------------

(source_file
  (select_statement
    (select_clause
      (select_clause_body
        (string
          (content))
        (string
          (content))
        (string
          (content))
        (string
          (content))
        (string
          (content))))))

================================================================================
AT TIME ZONE
================================================================================

SELECT '2001-02-16 20:38:40'::TIMESTAMP AT TIME ZONE 'America/Denver';

--------------------------------------------------------------------------------

(source_file
  (select_statement
    (select_clause
      (select_clause_body
        (at_time_zone_expression
          (type_cast
            (string
              (content))
            (type
              (identifier)))
          (string
            (content)))))))

================================================================================
ALTER SCHEMA
================================================================================

ALTER SCHEMA bar00 OWNER TO foo;
ALTER SCHEMA bar01 OWNER TO CURRENT_USER;
ALTER SCHEMA bar02 RENAME TO bar03;

--------------------------------------------------------------------------------

(source_file
  (alter_statement
    (schema
      (identifier)
      (owner_to
        (identifier))))
  (alter_statement
    (schema
      (identifier)
      (owner_to)))
  (alter_statement
    (schema
      (identifier)
      (rename_to
        (identifier)))))

================================================================================
ALTER TYPE
================================================================================

ALTER TYPE name OWNER TO new_owner;
ALTER TYPE name OWNER TO CURRENT_ROLE;
ALTER TYPE name OWNER TO CURRENT_USER;
ALTER TYPE name OWNER TO SESSION_USER;
ALTER TYPE name RENAME TO new_type_name;
ALTER TYPE name SET SCHEMA new_schema;
ALTER TYPE name RENAME ATTRIBUTE attribute_name TO new_attribute_name;
ALTER TYPE name RENAME ATTRIBUTE attribute_name TO new_attribute_name CASCADE;
ALTER TYPE name RENAME ATTRIBUTE attribute_name TO new_attribute_name RESTRICT;
ALTER TYPE name ADD VALUE 'new_enum_value';
ALTER TYPE name ADD VALUE IF NOT EXISTS 'new_enum_value';
ALTER TYPE name ADD VALUE 'new_enum_value' BEFORE 'neighbor_enum_value';
ALTER TYPE name ADD VALUE 'new_enum_value' AFTER 'neighbor_enum_value';
ALTER TYPE name RENAME VALUE 'existing_enum_value' TO 'new_enum_value';
ALTER TYPE name SET ( RECEIVE = v1, SUBSCRIPT = v2 );
ALTER TYPE name ADD ATTRIBUTE attribute_name integer;
ALTER TYPE name ADD ATTRIBUTE attribute_name integer COLLATE collation;
ALTER TYPE name ADD ATTRIBUTE attribute_name integer CASCADE;
ALTER TYPE name DROP ATTRIBUTE attribute_name;
ALTER TYPE name DROP ATTRIBUTE attribute_name CASCADE;
ALTER TYPE name DROP ATTRIBUTE IF EXISTS attribute_name;
ALTER TYPE name ALTER ATTRIBUTE attribute_name TYPE integer;
ALTER TYPE name ALTER ATTRIBUTE attribute_name SET DATA TYPE integer;
ALTER TYPE name ALTER ATTRIBUTE attribute_name TYPE integer COLLATE collation;
ALTER TYPE name ALTER ATTRIBUTE attribute_name TYPE integer CASCADE;

--------------------------------------------------------------------------------

(source_file
  (alter_type_statement
    (identifier)
    (owner_to
      (identifier)))
  (alter_type_statement
    (identifier)
    (owner_to))
  (alter_type_statement
    (identifier)
    (owner_to))
  (alter_type_statement
    (identifier)
    (owner_to))
  (alter_type_statement
    (identifier)
    (rename_to
      (identifier)))
  (alter_type_statement
    (identifier)
    (set_schema
      (identifier)))
  (alter_type_statement
    (identifier)
    (rename_attribute
      (identifier)
      (identifier)))
  (alter_type_statement
    (identifier)
    (rename_attribute
      (identifier)
      (identifier)))
  (alter_type_statement
    (identifier)
    (rename_attribute
      (identifier)
      (identifier)))
  (alter_type_statement
    (identifier)
    (add_value
      (string
        (content))))
  (alter_type_statement
    (identifier)
    (add_value
      (if_not_exists)
      (string
        (content))))
  (alter_type_statement
    (identifier)
    (add_value
      (string
        (content))
      (string
        (content))))
  (alter_type_statement
    (identifier)
    (add_value
      (string
        (content))
      (string
        (content))))
  (alter_type_statement
    (identifier)
    (rename_value
      (string
        (content))
      (string
        (content))))
  (alter_type_statement
    (identifier)
    (set_properties
      (assignment_expression_list
        (assignment_expression
          (identifier)
          (identifier))
        (assignment_expression
          (identifier)
          (identifier)))))
  (alter_type_statement
    (identifier)
    (add_attribute
      (identifier)
      (type
        (identifier))))
  (alter_type_statement
    (identifier)
    (add_attribute
      (identifier)
      (type
        (identifier))
      (collate
        (identifier))))
  (alter_type_statement
    (identifier)
    (add_attribute
      (identifier)
      (type
        (identifier))
      (relationship_behavior)))
  (alter_type_statement
    (identifier)
    (drop_attribute
      (identifier)))
  (alter_type_statement
    (identifier)
    (drop_attribute
      (identifier)
      (relationship_behavior)))
  (alter_type_statement
    (identifier)
    (drop_attribute
      (if_exists)
      (identifier)))
  (alter_type_statement
    (identifier)
    (alter_attribute
      (identifier)
      (set_data_type
        (type
          (identifier)))))
  (alter_type_statement
    (identifier)
    (alter_attribute
      (identifier)
      (set_data_type
        (type
          (identifier)))))
  (alter_type_statement
    (identifier)
    (alter_attribute
      (identifier)
      (set_data_type
        (type
          (identifier)))
      (collate
        (identifier))))
  (alter_type_statement
    (identifier)
    (alter_attribute
      (identifier)
      (set_data_type
        (type
          (identifier)))
      (relationship_behavior))))

================================================================================
JSON accessing operators
================================================================================

SELECT
  '[{"a":"foo"},{"b":"bar"},{"c":"baz"}]'::json->2,
  '{"a": {"b":"foo"}}'::json->'a',
  '[1,2,3]'::json->>2,
  '{"a":1,"b":2}'::json->>'b',
  '{"a": {"b":{"c": "foo"}}}'::json#>'{a,b}',
  '{"a":[1,2,3],"b":[4,5,6]}'::json#>>'{a,2}';

--------------------------------------------------------------------------------

(source_file
  (select_statement
    (select_clause
      (select_clause_body
        (json_access
          (type_cast
            (string
              (content))
            (type
              (identifier)))
          (number))
        (json_access
          (type_cast
            (string
              (content))
            (type
              (identifier)))
          (string
            (content)))
        (json_access
          (type_cast
            (string
              (content))
            (type
              (identifier)))
          (number))
        (json_access
          (type_cast
            (string
              (content))
            (type
              (identifier)))
          (string
            (content)))
        (json_access
          (type_cast
            (string
              (content))
            (type
              (identifier)))
          (string
            (content)))
        (json_access
          (type_cast
            (string
              (content))
            (type
              (identifier)))
          (string
            (content)))))))

================================================================================
COMMENT STATEMENT
================================================================================

COMMENT ON TABLE mytable IS 'This is my table.';
COMMENT ON TABLE mytable IS NULL;
COMMENT ON SCHEMA myschema IS 'my schema tables';
COMMENT ON FUNCTION public."Test]()&*^!@""'`\/#"() IS 'some comment';
COMMENT ON COLUMN foo.bar.baz IS 'This is a comment.';

--------------------------------------------------------------------------------

(source_file
  (comment_statement
    (identifier)
    (string
      (content)))
  (comment_statement
    (identifier)
    (NULL))
  (comment_statement
    (identifier)
    (string
      (content)))
  (comment_statement
    (function_call
      (dotted_name
        (identifier)
        (identifier)))
    (string
      (content)))
  (comment_statement
    (dotted_name
      (identifier)
      (identifier)
      (identifier))
    (string
      (content))))

================================================================================
TRUNCATE STATEMENT
================================================================================

TRUNCATE mytable;
TRUNCATE ONLY mytable;
TRUNCATE TABLE mytable;
TRUNCATE TABLE ONLY mytable;
TRUNCATE mytable1, mytable1, "My Table 3";
TRUNCATE TABLE tb1 *, tb2;
TRUNCATE TABLE tb1, tb2 RESTART IDENTITY;
TRUNCATE TABLE tb1, tb2 CONTINUE IDENTITY;
TRUNCATE TABLE tb1, tb2 CONTINUE IDENTITY CASCADE;

--------------------------------------------------------------------------------

(source_file
  (truncate_statement
    (identifier))
  (truncate_statement
    (identifier))
  (truncate_statement
    (identifier))
  (truncate_statement
    (identifier))
  (truncate_statement
    (identifier)
    (identifier)
    (identifier))
  (truncate_statement
    (identifier)
    (identifier))
  (truncate_statement
    (identifier)
    (identifier)
    (restart_identity))
  (truncate_statement
    (identifier)
    (identifier)
    (continue_identity))
  (truncate_statement
    (identifier)
    (identifier)
    (continue_identity)
    (relationship_behavior)))
